{
  "blogPostTitle": "Code, Design & Discoveries",
  "subTitleBlogPost": "Sharing my journey in code, design and discoveries",
  "blogYear2025": "2025",
  "blogPostTitlePart1": "On",
  "blogPostTitlePart2": "the",
  "blogPostTitlePart3": "way",
  "noBlogPost": "No blog posts available.",
  "readMore": "Read Full Post",

  "blogPostCards": [
    {
  "urlTitle": "haxan-graphic-layout",
  "day": ".25",
  "month": "JUNE",
  "title": "Häxan – Graphic Layout",
  "titleDescription": "When form meets darkness – poster, flyer, and roll-up for Häxan",
  "date": "2025-06-26",
  "content": "I was commissioned to create a new flyer for Alla Tiders Teater’s upcoming play *Häxan*, which premieres in October 2025. They had done a photoshoot with the some of the actors and wanted to use the images for a flyer, poster, and roll-up banner. Of course, I couldn’t say no!</br></br> It turned out to be an exciting challenge, as I’m not used to working with this kind of theatrical photography. The requirement was to include a photo of the actors along with a red-orange background. I presented several different concepts – and this one was Alla Tiders Teater’s favorite.</br></br> It was great fun to experiment with the images and explore different ideas. One idea sparked another, and soon I had created quite a few different versions before we found the right one.</br></br> Have been working with this theatre group since 2023, and I love it. They a theatre group with a big heart, and they always have interesting projects. So hope more years to come.",
  "httpHomepage": "https://www.allatidersteater.se/",
  "img": "/assets/images/portfolio/graphic/allaTiders/allaTiders-haxan-flyer.jpg",
  "suffix": "Graphic",
  "titleTeche": "Technologies",
  "technologies": ["Photoshop", "Illustrator"],
  "status": "Completed",
  "titleKeyFeature": "Key Features",
  "keyFeatures": [
    "Layout",
    "Graphic design",
    "Poster design",
    "Flyer design",
    "Roll-up design"
  ],
  "icon": {
    "name": "icon-park-twotone:web-page",
    "width": 40,
    "height": 40,
    "color": ""
  },
  "privateText": "Alla Tiders Teater – official website"
},
    {
      "urlTitle": "warp-terminal",
      "day": ".18",
      "month": "MARCH",
      "title": "Warp",
      "titleDescription": "The Only Terminal I Need",
      "date": "2025-03-20",
      "content": "I've been using Warp for a while now and I have to say, it's the only terminal I ever need. It was first released for Mac, and I discovered it when I had issues with my built-in terminal and was looking for a new one. That's when I found Warp. <br> At that time, it was only available for Mac, and I had been checking for updates for Windows from time to time. A few weeks ago, it finally came to Windows, and I was thrilled. The installation process was incredibly simple on both Mac and Windows. Sure, it offers different themes and customizable text options, but the absolute best part is that I can now save my terminal commands. I have many commands in my head, but not all of them, and some I don't use that often. For example, when I need to change a commit message. Sure, Google can help, but now I can save those commands and access them with one click when I need them.<br><br> <b>Another amazing feature is the built-in AI, which lets me write and ask for specific commands, and it actually explains what the command does.</b> Another thing I love is that I don't have to use the arrow keys to navigate - I can simply use my mouse. If I notice a typo, I can click on it and change it directly. It's so much easier. <br><br> I really love it. It's a must-have for any developer who appreciates the power of the terminal, just like I do.",
      "httpHomepage": "https://warp.dev/",
      "img": "/assets/images/blog/warp-terminal.jpg",
      "suffix": "Tech",
      "titleTeche": "Technologies",
      "technologies": ["AI", "Terminal", "Cross-Platform"],
      "status": "Completed",
      "titleKeyFeature": "Key Features",
      "keyFeatures": ["AI-assisted terminal commands"],
      "icon": {
        "name": "icon-park-twotone:web-page",
        "width": 40,
        "height": 40,
        "color": "text-text-primary"
      }
    },
    {
      "urlTitle": "printagon-order",
      "day": ".20",
      "month": "MARCH",
      "title": "Printagon Order Form",
      "titleDescription": "Creating a new order form for Printagon",
      "date": "2025-03-20",
      "content": "Right now, I'm working on a new Printagon order form. I had a meeting with a client to discuss their needs before implementing the feature. Which fields should be mandatory. After the meeting, I started working on the form. So now I'm working on the backend API, which will be completed soon before I move on to the frontend and create the reusable input form with input fields and text area.",
      "img": "/assets/images/blog/PG-newOrder.jpg",
      "suffix": "Code",
      "httpHomepage": "https://github.com/FiaNerd",
      "titleTeche": "Technologies",
      "technologies": ["C#", "ASP.NET", "SQL"],
      "status": "In Progress",
      "duration": "2 months",
      "titleKeyFeature": "Key Features",
      "keyFeatures": [
        "Customizable form fields",
        "Backend integration",
        "Reusable input components",
        "Responsive design",
        "Validation"
      ],
      "icon": {
        "name": "jam:github",
        "width": 40,
        "height": 40,
        "color": ""
      },
      "privateText": "This repo is private. BUT checkout my other projects."
    }
  ]
}
